{
  "\n": 11,
  "\r": 10,
  " ": 1,
  "!": 65,
  "\"": 64,
  "#": 220,
  "$": 432,
  "%": 142,
  "&": 290,
  "'": 34,
  "(": 66,
  ")": 67,
  "*": 58,
  "+": 152,
  ",": 46,
  "-": 115,
  ".": 27,
  "/": 90,
  "0": 56,
  "1": 60,
  "2": 59,
  "3": 62,
  "4": 81,
  "5": 70,
  "6": 87,
  "7": 91,
  "8": 84,
  "9": 82,
  ":": 9,
  ";": 187,
  "<": 191,
  "=": 113,
  ">": 177,
  "?": 33,
  "@": 176,
  "[": 345,
  "\\": 370,
  "]": 328,
  "^": 234,
  "_": 138,
  "`": 205,
  "a": 0,
  "b": 22,
  "c": 15,
  "d": 13,
  "e": 3,
  "f": 24,
  "g": 23,
  "h": 18,
  "i": 2,
  "j": 52,
  "k": 36,
  "l": 12,
  "m": 8,
  "n": 4,
  "o": 5,
  "p": 17,
  "q": 29,
  "r": 7,
  "s": 14,
  "t": 6,
  "u": 19,
  "v": 21,
  "w": 37,
  "x": 57,
  "y": 42,
  "z": 26,
  "~": 359,
  "\u00a1": 190,
  "\u00aa": 528,
  "\u00af": 324,
  "\u00b0": 170,
  "\u00b4": 155,
  "\u00b7": 343,
  "\u00ba": 270,
  "\u00bf": 128,
  "\u00e0": 47,
  "\u00e1": 233,
  "\u00e6": 542,
  "\u00e7": 472,
  "\u00e8": 32,
  "\u00e9": 39,
  "\u00ec": 35,
  "\u00ed": 114,
  "\u00ee": 381,
  "\u00ef": 504,
  "\u00f1": 411,
  "\u00f2": 41,
  "\u00f3": 144,
  "\u00f4": 434,
  "\u00f5": 412,
  "\u00f6": 249,
  "\u00f8": 403,
  "\u00f9": 48,
  "\u00fa": 295,
  "\u00fb": 474,
  "\u00fc": 452,
  "\u0119": 445,
  "\u014f": 391,
  "\u0153": 344,
  "\u01aa": 495,
  "\u026a": 462,
  "\u0283": 470,
  "\u0292": 399,
  "\u0294": 375,
  "\u0295": 379,
  "\u0296": 409,
  "\u0298": 349,
  "\u02d6": 496,
  "\u02d8": 196,
  "\u02d9": 285,
  "\u02f5": 346,
  "\u0300": 262,
  "\u0301": 257,
  "\u0325": 108,
  "\u0329": 124,
  "\u032b": 254,
  "\u032e": 326,
  "\u035c": 439,
  "\u0361": 363,
  "\u03c9": 185,
  "\u0434": 352,
  "\u0437": 365,
  "\u06dd": 314,
  "\u0b67": 471,
  "\u0b68": 441,
  "\u0c97": 401,
  "\u0ca0": 210,
  "\u0ca5": 186,
  "\u0cb0": 369,
  "\u0df4": 306,
  "\u0e31": 213,
  "\u0e51": 364,
  "\u0eb6": 153,
  "\u0f0e": 162,
  "\u0f1a": 529,
  "\u0f3c": 287,
  "\u0f3d": 282,
  "\u10da": 366,
  "\u1564": 400,
  "\u1566": 477,
  "\u15d2": 386,
  "\u15d5": 377,
  "\u15e9": 376,
  "\u1d17": 246,
  "\u1d25": 389,
  "\u1d52": 356,
  "\u1d55": 323,
  "\u1d85": 546,
  "\u1d98": 454,
  "\u200d": 85,
  "\u200e": 222,
  "\u2011": 419,
  "\u2013": 357,
  "\u2018": 435,
  "\u2019": 141,
  "\u201c": 494,
  "\u201d": 457,
  "\u2022": 148,
  "\u203d": 168,
  "\u203f": 163,
  "\u207f": 515,
  "\u20ac": 189,
  "\u2200": 368,
  "\u221e": 355,
  "\u2229": 466,
  "\u2266": 425,
  "\u2267": 488,
  "\u2322": 538,
  "\u2323": 305,
  "\u2445": 536,
  "\u2500": 331,
  "\u2501": 230,
  "\u252c": 279,
  "\u253b": 194,
  "\u2560": 408,
  "\u2563": 492,
  "\u2565": 284,
  "\u256d": 255,
  "\u256e": 252,
  "\u256f": 258,
  "\u2570": 512,
  "\u2582": 422,
  "\u25a1": 382,
  "\u25cd": 238,
  "\u25d4": 277,
  "\u25d5": 214,
  "\u25e1": 310,
  "\u2600": 405,
  "\u2618": 271,
  "\u261d": 521,
  "\u261e": 299,
  "\u2639": 95,
  "\u263a": 98,
  "\u2640": 146,
  "\u2642": 127,
  "\u264b": 387,
  "\u264c": 500,
  "\u264e": 508,
  "\u2661": 340,
  "\u2665": 125,
  "\u266a": 372,
  "\u267e": 251,
  "\u2688": 378,
  "\u2693": 301,
  "\u26b0": 489,
  "\u26f1": 522,
  "\u2702": 513,
  "\u2708": 484,
  "\u270a": 362,
  "\u271d": 544,
  "\u2727": 330,
  "\u2728": 126,
  "\u273f": 463,
  "\u2744": 413,
  "\u2753": 373,
  "\u2757": 132,
  "\u275b": 361,
  "\u2763": 88,
  "\u2764": 16,
  "\u2765": 527,
  "\u2b50": 288,
  "\u3012": 322,
  "\u3063": 226,
  "\u3064": 286,
  "\u3065": 278,
  "\u309d": 430,
  "\u30a6": 539,
  "\u30af": 459,
  "\u30b7": 461,
  "\u30c1": 499,
  "\u30ce": 182,
  "\u30e7": 509,
  "\u30fd": 505,
  "\u30fe": 388,
  "\u3268": 545,
  "\u4e2a": 338,
  "\u5f61": 506,
  "\u706c": 396,
  "\ua228": 266,
  "\ua4b0": 507,
  "\ua4b1": 493,
  "\ufe0f": 20,
  "\ufe35": 241,
  "\ufe3f": 333,
  "\ufe4f": 229,
  "\uff09": 394,
  "\uff1b": 212,
  "\uff20": 276,
  "\uff3c": 289,
  "\uff40": 259,
  "\uff61": 166,
  "\uff65": 183,
  "\uff70": 339,
  "\uff89": 272,
  "\uff9f": 232,
  "\ud835\udce3": 455,
  "\ud835\udcea": 444,
  "\ud835\udcf2": 476,
  "\ud835\udcf6": 418,
  "\ud835\udcf8": 485,
  "\ud83c\udd71": 184,
  "\ud83c\udd96": 523,
  "\ud83c\udde8": 311,
  "\ud83c\uddf3": 294,
  "\ud83c\uddf7": 384,
  "\ud83c\uddf9": 543,
  "\ud83c\uddfa": 498,
  "\ud83c\ude32": 524,
  "\ud83c\udf03": 442,
  "\ud83c\udf08": 107,
  "\ud83c\udf0a": 131,
  "\ud83c\udf12": 446,
  "\ud83c\udf19": 354,
  "\ud83c\udf1a": 296,
  "\ud83c\udf1d": 532,
  "\ud83c\udf1e": 392,
  "\ud83c\udf1f": 420,
  "\ud83c\udf21": 526,
  "\ud83c\udf27": 535,
  "\ud83c\udf29": 332,
  "\ud83c\udf2d": 438,
  "\ud83c\udf38": 43,
  "\ud83c\udf39": 76,
  "\ud83c\udf3a": 117,
  "\ud83c\udf41": 433,
  "\ud83c\udf46": 245,
  "\ud83c\udf4c": 437,
  "\ud83c\udf50": 302,
  "\ud83c\udf51": 147,
  "\ud83c\udf54": 371,
  "\ud83c\udf55": 360,
  "\ud83c\udf5d": 342,
  "\ud83c\udf5f": 383,
  "\ud83c\udf63": 94,
  "\ud83c\udf6d": 482,
  "\ud83c\udf6f": 350,
  "\ud83c\udf71": 291,
  "\ud83c\udf73": 473,
  "\ud83c\udf7a": 348,
  "\ud83c\udf7e": 297,
  "\ud83c\udf87": 479,
  "\ud83c\udf88": 448,
  "\ud83c\udf89": 92,
  "\ud83c\udf8a": 312,
  "\ud83c\udfaf": 541,
  "\ud83c\udfbb": 313,
  "\ud83c\udfc3": 491,
  "\ud83c\udfca": 316,
  "\ud83c\udfd2": 431,
  "\ud83c\udfd6": 321,
  "\ud83c\udfe7": 395,
  "\ud83c\udfe9": 398,
  "\ud83c\udff3": 135,
  "\ud83c\udff9": 151,
  "\ud83c\udffb": 79,
  "\ud83c\udfff": 208,
  "\ud83d\udc01": 347,
  "\ud83d\udc07": 253,
  "\ud83d\udc08": 129,
  "\ud83d\udc09": 464,
  "\ud83d\udc0b": 283,
  "\ud83d\udc12": 145,
  "\ud83d\udc14": 374,
  "\ud83d\udc15": 308,
  "\ud83d\udc1b": 71,
  "\ud83d\udc1c": 410,
  "\ud83d\udc1f": 104,
  "\ud83d\udc20": 265,
  "\ud83d\udc23": 315,
  "\ud83d\udc24": 204,
  "\ud83d\udc25": 218,
  "\ud83d\udc26": 123,
  "\ud83d\udc27": 518,
  "\ud83d\udc28": 402,
  "\ud83d\udc2c": 424,
  "\ud83d\udc2d": 236,
  "\ud83d\udc2f": 80,
  "\ud83d\udc30": 169,
  "\ud83d\udc31": 201,
  "\ud83d\udc34": 207,
  "\ud83d\udc36": 224,
  "\ud83d\udc37": 337,
  "\ud83d\udc38": 417,
  "\ud83d\udc39": 121,
  "\ud83d\udc3a": 227,
  "\ud83d\udc3b": 261,
  "\ud83d\udc3c": 154,
  "\ud83d\udc40": 209,
  "\ud83d\udc45": 281,
  "\ud83d\udc46": 467,
  "\ud83d\udc48": 202,
  "\ud83d\udc49": 217,
  "\ud83d\udc4b": 136,
  "\ud83d\udc4c": 109,
  "\ud83d\udc4d": 140,
  "\ud83d\udc4f": 130,
  "\ud83d\udc59": 427,
  "\ud83d\udc66": 180,
  "\ud83d\udc67": 171,
  "\ud83d\udc68": 156,
  "\ud83d\udc69": 179,
  "\ud83d\udc6a": 502,
  "\ud83d\udc6b": 490,
  "\ud83d\udc6f": 407,
  "\ud83d\udc70": 534,
  "\ud83d\udc78": 428,
  "\ud83d\udc7a": 53,
  "\ud83d\udc7b": 533,
  "\ud83d\udc7d": 511,
  "\ud83d\udc80": 244,
  "\ud83d\udc81": 358,
  "\ud83d\udc84": 465,
  "\ud83d\udc8b": 303,
  "\ud83d\udc8d": 436,
  "\ud83d\udc8e": 327,
  "\ud83d\udc8f": 269,
  "\ud83d\udc91": 415,
  "\ud83d\udc93": 54,
  "\ud83d\udc94": 174,
  "\ud83d\udc95": 40,
  "\ud83d\udc96": 38,
  "\ud83d\udc97": 44,
  "\ud83d\udc98": 93,
  "\ud83d\udc99": 143,
  "\ud83d\udc9a": 133,
  "\ud83d\udc9b": 149,
  "\ud83d\udc9c": 96,
  "\ud83d\udc9d": 75,
  "\ud83d\udc9e": 25,
  "\ud83d\udc9f": 468,
  "\ud83d\udca3": 421,
  "\ud83d\udca4": 298,
  "\ud83d\udca5": 319,
  "\ud83d\udca6": 275,
  "\ud83d\udca9": 193,
  "\ud83d\udcaa": 150,
  "\ud83d\udcab": 335,
  "\ud83d\udcb0": 531,
  "\ud83d\udcda": 416,
  "\ud83d\udce6": 200,
  "\ud83d\udd11": 260,
  "\ud83d\udd12": 503,
  "\ud83d\udd1d": 385,
  "\ud83d\udd1e": 458,
  "\ud83d\udd25": 72,
  "\ud83d\udd2a": 537,
  "\ud83d\udd2b": 307,
  "\ud83d\udd2c": 460,
  "\ud83d\udd49": 510,
  "\ud83d\udd95": 160,
  "\ud83d\udda4": 192,
  "\ud83d\udda5": 443,
  "\ud83d\ude00": 242,
  "\ud83d\ude01": 102,
  "\ud83d\ude02": 28,
  "\ud83d\ude03": 240,
  "\ud83d\ude04": 225,
  "\ud83d\ude05": 78,
  "\ud83d\ude06": 239,
  "\ud83d\ude07": 110,
  "\ud83d\ude08": 165,
  "\ud83d\ude09": 99,
  "\ud83d\ude0a": 118,
  "\ud83d\ude0b": 167,
  "\ud83d\ude0c": 73,
  "\ud83d\ude0d": 45,
  "\ud83d\ude0e": 175,
  "\ud83d\ude0f": 101,
  "\ud83d\ude10": 447,
  "\ud83d\ude11": 199,
  "\ud83d\ude12": 55,
  "\ud83d\ude13": 221,
  "\ud83d\ude14": 49,
  "\ud83d\ude15": 120,
  "\ud83d\ude16": 77,
  "\ud83d\ude18": 89,
  "\ud83d\ude19": 139,
  "\ud83d\ude1a": 280,
  "\ud83d\ude1b": 215,
  "\ud83d\ude1c": 393,
  "\ud83d\ude1d": 273,
  "\ud83d\ude1e": 31,
  "\ud83d\ude1f": 83,
  "\ud83d\ude20": 51,
  "\ud83d\ude21": 50,
  "\ud83d\ude22": 74,
  "\ud83d\ude23": 219,
  "\ud83d\ude24": 237,
  "\ud83d\ude25": 380,
  "\ud83d\ude26": 406,
  "\ud83d\ude27": 483,
  "\ud83d\ude29": 178,
  "\ud83d\ude2b": 206,
  "\ud83d\ude2c": 122,
  "\ud83d\ude2d": 61,
  "\ud83d\ude30": 320,
  "\ud83d\ude31": 318,
  "\ud83d\ude33": 97,
  "\ud83d\ude34": 300,
  "\ud83d\ude35": 216,
  "\ud83d\ude36": 248,
  "\ud83d\ude37": 198,
  "\ud83d\ude3b": 404,
  "\ud83d\ude41": 223,
  "\ud83d\ude42": 111,
  "\ud83d\ude43": 106,
  "\ud83d\ude44": 63,
  "\ud83d\ude45": 481,
  "\ud83d\ude46": 517,
  "\ud83d\ude47": 423,
  "\ud83d\ude48": 116,
  "\ud83d\ude49": 274,
  "\ud83d\ude4a": 341,
  "\ud83d\ude4b": 351,
  "\ud83d\ude4c": 469,
  "\ud83d\ude4f": 188,
  "\ud83d\ude92": 292,
  "\ud83d\ude97": 317,
  "\ud83d\ude9c": 530,
  "\ud83d\udea3": 514,
  "\ud83d\udeab": 478,
  "\ud83d\udeba": 516,
  "\ud83d\udecc": 480,
  "\ud83d\udecf": 487,
  "\ud83e\udd0d": 134,
  "\ud83e\udd0e": 173,
  "\ud83e\udd0f": 501,
  "\ud83e\udd11": 353,
  "\ud83e\udd12": 334,
  "\ud83e\udd13": 520,
  "\ud83e\udd14": 119,
  "\ud83e\udd15": 450,
  "\ud83e\udd17": 164,
  "\ud83e\udd18": 231,
  "\ud83e\udd1a": 304,
  "\ud83e\udd1b": 250,
  "\ud83e\udd1c": 268,
  "\ud83e\udd1d": 456,
  "\ud83e\udd1e": 247,
  "\ud83e\udd21": 397,
  "\ud83e\udd22": 453,
  "\ud83e\udd23": 69,
  "\ud83e\udd24": 264,
  "\ud83e\udd26": 440,
  "\ud83e\udd27": 267,
  "\ud83e\udd28": 100,
  "\ud83e\udd29": 211,
  "\ud83e\udd2a": 243,
  "\ud83e\udd2b": 256,
  "\ud83e\udd2c": 197,
  "\ud83e\udd2d": 86,
  "\ud83e\udd2e": 367,
  "\ud83e\udd2f": 137,
  "\ud83e\udd30": 158,
  "\ud83e\udd31": 451,
  "\ud83e\udd35": 475,
  "\ud83e\udd37": 112,
  "\ud83e\udd42": 449,
  "\ud83e\udd4f": 497,
  "\ud83e\udd53": 540,
  "\ud83e\udd5a": 525,
  "\ud83e\udd5e": 414,
  "\ud83e\udd6c": 336,
  "\ud83e\udd70": 30,
  "\ud83e\udd71": 390,
  "\ud83e\udd73": 103,
  "\ud83e\udd74": 181,
  "\ud83e\udd75": 161,
  "\ud83e\udd76": 159,
  "\ud83e\udd7a": 68,
  "\ud83e\udd81": 203,
  "\ud83e\udd84": 519,
  "\ud83e\udd89": 426,
  "\ud83e\udd8a": 325,
  "\ud83e\udd8b": 172,
  "\ud83e\udd8c": 105,
  "\ud83e\udd96": 486,
  "\ud83e\udd9d": 195,
  "\ud83e\uddd0": 228,
  "\ud83e\uddda": 293,
  "\ud83e\udddc": 329,
  "\ud83e\udde0": 235,
  "\ud83e\udde1": 157,
  "\ud83e\uddf6": 429,
  "\ud83e\ude78": 263,
  "\ud83e\ude80": 309
}