{
  "\t": 176,
  "\n": 10,
  "\r": 9,
  " ": 0,
  "!": 45,
  "\"": 56,
  "#": 103,
  "$": 163,
  "%": 139,
  "&": 111,
  "'": 31,
  "(": 70,
  ")": 59,
  "*": 74,
  "+": 107,
  ",": 44,
  "-": 73,
  ".": 26,
  "/": 42,
  "0": 50,
  "1": 49,
  "2": 61,
  "3": 55,
  "4": 64,
  "5": 66,
  "6": 72,
  "7": 78,
  "8": 75,
  "9": 69,
  ":": 11,
  ";": 110,
  "<": 34,
  "=": 37,
  ">": 33,
  "?": 32,
  "@": 101,
  "[": 166,
  "\\": 140,
  "]": 168,
  "^": 159,
  "_": 84,
  "a": 1,
  "b": 20,
  "c": 15,
  "d": 13,
  "e": 2,
  "f": 22,
  "g": 18,
  "h": 16,
  "i": 3,
  "j": 43,
  "k": 36,
  "l": 5,
  "m": 8,
  "n": 6,
  "o": 4,
  "p": 19,
  "q": 30,
  "r": 14,
  "s": 12,
  "t": 7,
  "u": 17,
  "v": 21,
  "w": 40,
  "x": 57,
  "y": 38,
  "z": 23,
  "|": 157,
  "~": 156,
  "\u0081": 104,
  "\u008d": 63,
  "\u008f": 46,
  "\u0090": 67,
  "\u009d": 51,
  "\u00a1": 102,
  "\u00a2": 131,
  "\u00a3": 108,
  "\u00a4": 76,
  "\u00a5": 136,
  "\u00a6": 95,
  "\u00a7": 135,
  "\u00a8": 39,
  "\u00a9": 58,
  "\u00aa": 126,
  "\u00ab": 141,
  "\u00ac": 60,
  "\u00ad": 65,
  "\u00ae": 124,
  "\u00af": 147,
  "\u00b0": 120,
  "\u00b1": 97,
  "\u00b2": 62,
  "\u00b3": 122,
  "\u00b4": 161,
  "\u00b5": 133,
  "\u00b6": 127,
  "\u00b7": 123,
  "\u00b8": 164,
  "\u00b9": 77,
  "\u00ba": 142,
  "\u00bb": 106,
  "\u00bc": 114,
  "\u00bd": 89,
  "\u00be": 167,
  "\u00bf": 113,
  "\u00df": 339,
  "\u00e0": 83,
  "\u00e2": 25,
  "\u00e3": 24,
  "\u00e4": 244,
  "\u00e5": 87,
  "\u00e6": 206,
  "\u00e7": 180,
  "\u00e8": 52,
  "\u00e9": 68,
  "\u00ea": 197,
  "\u00ec": 80,
  "\u00ed": 148,
  "\u00ef": 92,
  "\u00f0": 29,
  "\u00f1": 204,
  "\u00f2": 86,
  "\u00f3": 154,
  "\u00f8": 217,
  "\u00f9": 93,
  "\u00fa": 230,
  "\u00fb": 289,
  "\u00fc": 313,
  "\u00ff": 28,
  "\u0153": 47,
  "\u0161": 85,
  "\u016b": 301,
  "\u017e": 41,
  "\u0192": 105,
  "\u02c6": 71,
  "\u02dc": 35,
  "\u0300": 96,
  "\u0301": 155,
  "\u0308": 303,
  "\u03c0": 234,
  "\u0627": 239,
  "\u0628": 329,
  "\u0631": 308,
  "\u0632": 299,
  "\u0633": 288,
  "\u064a": 343,
  "\u0c19": 247,
  "\u0c1e": 252,
  "\u0c3e": 236,
  "\u0c4d": 226,
  "\u200d": 134,
  "\u200e": 53,
  "\u200f": 54,
  "\u2013": 82,
  "\u2014": 129,
  "\u2018": 81,
  "\u2019": 88,
  "\u201a": 48,
  "\u201c": 100,
  "\u201d": 98,
  "\u201e": 99,
  "\u2020": 118,
  "\u2021": 116,
  "\u2022": 79,
  "\u2026": 125,
  "\u202e": 318,
  "\u2030": 90,
  "\u2039": 112,
  "\u203a": 160,
  "\u2067": 277,
  "\u20ac": 27,
  "\u20e3": 255,
  "\u2122": 94,
  "\u2139": 315,
  "\u2205": 245,
  "\u2518": 258,
  "\u2639": 186,
  "\u2640": 253,
  "\u2642": 138,
  "\u264b": 325,
  "\u26ab": 235,
  "\u26bd": 281,
  "\u270a": 349,
  "\u270b": 202,
  "\u270c": 320,
  "\u2713": 334,
  "\u2763": 328,
  "\u2764": 128,
  "\u2796": 340,
  "\u3000": 233,
  "\u3063": 246,
  "\u30a1": 263,
  "\u30a2": 229,
  "\u30a3": 250,
  "\u30a4": 132,
  "\u30a6": 218,
  "\u30a7": 268,
  "\u30aa": 304,
  "\u30ab": 286,
  "\u30ad": 211,
  "\u30af": 341,
  "\u30b0": 305,
  "\u30b2": 192,
  "\u30b7": 287,
  "\u30b9": 205,
  "\u30ba": 309,
  "\u30bb": 350,
  "\u30bd": 342,
  "\u30c1": 228,
  "\u30c3": 149,
  "\u30c6": 260,
  "\u30c8": 213,
  "\u30c9": 153,
  "\u30ca": 319,
  "\u30cd": 162,
  "\u30cf": 282,
  "\u30d0": 158,
  "\u30d5": 223,
  "\u30d7": 178,
  "\u30db": 312,
  "\u30df": 275,
  "\u30e0": 137,
  "\u30e3": 354,
  "\u30e6": 182,
  "\u30e8": 189,
  "\u30ea": 347,
  "\u30eb": 265,
  "\u30ec": 198,
  "\u30f3": 188,
  "\u30fb": 121,
  "\u30fc": 145,
  "\uff08": 183,
  "\uff09": 171,
  "\uff3f": 243,
  "\uff41": 269,
  "\uff43": 227,
  "\uff44": 270,
  "\uff45": 249,
  "\uff48": 273,
  "\uff49": 264,
  "\uff4e": 293,
  "\uff4f": 259,
  "\uff50": 285,
  "\uff52": 231,
  "\uff53": 307,
  "\uff55": 344,
  "\ud83c\udf0a": 276,
  "\ud83c\udf1a": 172,
  "\ud83c\udf1f": 232,
  "\ud83c\udf2f": 208,
  "\ud83c\udf37": 292,
  "\ud83c\udf39": 326,
  "\ud83c\udf45": 330,
  "\ud83c\udf48": 297,
  "\ud83c\udf4c": 300,
  "\ud83c\udf51": 257,
  "\ud83c\udf59": 284,
  "\ud83c\udf5a": 333,
  "\ud83c\udf7e": 335,
  "\ud83c\udf89": 165,
  "\ud83c\udf8a": 200,
  "\ud83c\udfb7": 248,
  "\ud83c\udfb9": 221,
  "\ud83c\udfc0": 302,
  "\ud83c\udffb": 151,
  "\ud83c\udffd": 220,
  "\ud83c\udfff": 170,
  "\ud83d\udc14": 238,
  "\ud83d\udc26": 291,
  "\ud83d\udc3d": 316,
  "\ud83d\udc41": 345,
  "\ud83d\udc43": 295,
  "\ud83d\udc45": 152,
  "\ud83d\udc46": 225,
  "\ud83d\udc48": 212,
  "\ud83d\udc49": 216,
  "\ud83d\udc4b": 175,
  "\ud83d\udc4c": 262,
  "\ud83d\udc4d": 199,
  "\ud83d\udc4f": 179,
  "\ud83d\udc7a": 280,
  "\ud83d\udc95": 195,
  "\ud83d\udca6": 130,
  "\ud83d\udcb2": 348,
  "\ud83d\udcde": 311,
  "\ud83d\udce6": 215,
  "\ud83d\udcf7": 321,
  "\ud83d\udd1d": 193,
  "\ud83d\udd25": 322,
  "\ud83d\udd31": 306,
  "\ud83d\udd78": 279,
  "\ud83d\udd90": 241,
  "\ud83d\udd95": 187,
  "\ud83d\udde8": 296,
  "\ud83d\ude00": 323,
  "\ud83d\ude01": 184,
  "\ud83d\ude02": 91,
  "\ud83d\ude03": 196,
  "\ud83d\ude04": 169,
  "\ud83d\ude05": 336,
  "\ud83d\ude06": 209,
  "\ud83d\ude07": 351,
  "\ud83d\ude08": 283,
  "\ud83d\ude09": 119,
  "\ud83d\ude0a": 210,
  "\ud83d\ude0b": 353,
  "\ud83d\ude0c": 201,
  "\ud83d\ude0d": 109,
  "\ud83d\ude0e": 298,
  "\ud83d\ude0f": 150,
  "\ud83d\ude11": 327,
  "\ud83d\ude12": 317,
  "\ud83d\ude13": 266,
  "\ud83d\ude18": 115,
  "\ud83d\ude19": 274,
  "\ud83d\ude1d": 219,
  "\ud83d\ude1e": 267,
  "\ud83d\ude21": 191,
  "\ud83d\ude22": 242,
  "\ud83d\ude28": 190,
  "\ud83d\ude29": 251,
  "\ud83d\ude2a": 337,
  "\ud83d\ude2b": 207,
  "\ud83d\ude2c": 177,
  "\ud83d\ude2d": 117,
  "\ud83d\ude30": 346,
  "\ud83d\ude31": 143,
  "\ud83d\ude33": 314,
  "\ud83d\ude34": 331,
  "\ud83d\ude35": 185,
  "\ud83d\ude3b": 290,
  "\ud83d\ude42": 144,
  "\ud83d\ude43": 173,
  "\ud83d\ude44": 352,
  "\ud83d\ude48": 224,
  "\ud83d\ude4b": 194,
  "\ud83d\ude4c": 256,
  "\ud83d\ude4f": 240,
  "\ud83e\udd14": 181,
  "\ud83e\udd17": 203,
  "\ud83e\udd21": 254,
  "\ud83e\udd22": 324,
  "\ud83e\udd23": 174,
  "\ud83e\udd24": 338,
  "\ud83e\udd26": 222,
  "\ud83e\udd27": 355,
  "\ud83e\udd2c": 278,
  "\ud83e\udd2d": 261,
  "\ud83e\udd36": 310,
  "\ud83e\udd37": 146,
  "\ud83e\udd5a": 332,
  "\ud83e\udd66": 237,
  "\ud83e\udd84": 272,
  "\ud83e\udd87": 294,
  "\ud83e\udd95": 271,
  "\ud83e\uddd0": 214
}